lvx/base/Documents/бит_кзн_ЗакрытиеДокументовПланирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_кзн_ЗакрытиеДокументовПланирования</Name>
			<BasedOn>
				<xr:Item>Document.бит_кзн_ЗаявкаНаРасходованиеСредств</xr:Item>
				<xr:Item>Document.бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств</xr:Item>
				<xr:Item>Document.бит_кзн_ПланируемоеПоступлениеДенежныхСредств</xr:Item>
				<xr:Item>Document.бит_кзн_ПлатежнаяПозиция</xr:Item>
				<xr:Item>Document.бит_кзн_ПозицияПоступления</xr:Item>
				<xr:Item>Document.бит_кзн_ЗаявкаНаПереводСредствВДругуюОрганизацию</xr:Item>
				<xr:Item>Document.бит_пз_ЗаявкаНаЗатраты</xr:Item>
				<xr:Item>Document.бит_пз_СводнаяЗаявкаНаЗатраты</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.бит_кзн_ПланируемоеПоступлениеДенежныхСредств</xr:Item>
				<xr:Item>AccumulationRegister.бит_КонтрольныеЗначенияБюджетов</xr:Item>
				<xr:Item>AccumulationRegister.бит_кзн_ПланируемыйРасходДенежныхСредствАналитика</xr:Item>
				<xr:Item>AccumulationRegister.бит_кзн_ПланируемоеПоступлениеДенежныхСредствАналитика</xr:Item>
				<xr:Item>AccumulationRegister.бит_кзн_ПланируемыйРасходДенежныхСредств</xr:Item>
				<xr:Item>AccumulationRegister.бит_пз_ПланируемыеЗатраты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Comment>Ручная корректировка - служебный реквизит</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Ответственный</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДокументыПланирования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументПланирования</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.бит_кзн_ПозицияПоступления</v8:Type>
								<v8:Type>cfg:DocumentRef.бит_кзн_ПлатежнаяПозиция</v8:Type>
								<v8:Type>cfg:DocumentRef.бит_кзн_ЗаявкаНаПереводСредствВДругуюОрганизацию</v8:Type>
								<v8:Type>cfg:DocumentRef.бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств</v8:Type>
								<v8:Type>cfg:DocumentRef.бит_пз_ЗаявкаНаЗатраты</v8:Type>
								<v8:Type>cfg:DocumentRef.бит_кзн_ПланируемоеПоступлениеДенежныхСредств</v8:Type>
								<v8:Type>cfg:DocumentRef.бит_пз_СводнаяЗаявкаНаЗатраты</v8:Type>
								<v8:Type>cfg:DocumentRef.бит_кзн_ЗаявкаНаРасходованиеСредств</v8:Type>
								<v8:Type>cfg:DocumentRef.бит_пз_ОтражениеФактаЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаЗакрытия</Name>
							<Comment>Причина закрытия</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ПричиныЗакрытияДокументовПланированияПлатежа</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

lvx/base/Enums/бит_ТипыСтатусовОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ТипыСтатусовОбъектов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаСогласовании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Утвержден</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастичноИсполнен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исполнен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРеестре</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

lvx/base/Documents/бит_кзн_ЗакрытиеДокументовПланирования/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаОбъектаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);
	
	МетаданныеОбъекта = Объект.Ссылка.Метаданные();
		
	Если Параметры.Свойство("Основание") Тогда		
		ПроверитьВозможностьСозданияЗакрытия(Параметры.Основание, Отказ);		
	КонецЕсли; 
		
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	// Заполняем кэш значений.	
	ЗаполнитьКэшЗначений(мКэшЗначений);
	
	мКэшЗначений.Вставить("Организация"         , Объект.Организация);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	 
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Объект.ДокументыПланирования.Очистить();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДокументыПланирования

&НаКлиенте
Процедура ДокументыПланированияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И НЕ Копирование Тогда
		Элемент.ТекущиеДанные.ПричинаЗакрытия = ПредопределенноеЗначение("Справочник.бит_ПричиныЗакрытияДокументовПланированияПлатежа.Отмена");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыПланированияДокументПланированияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Тип") Тогда
		Возврат;
	КонецЕсли;
	
	ТипСтатусаДокументаПланирования = ТипСтатуаВыбранногоЗначения(ВыбранноеЗначение);
	
	Если ТипСтатусаДокументаПланирования = ПредопределенноеЗначение("Перечисление.бит_ТипыСтатусовОбъектов.Закрыт") Тогда
		СтандартнаяОбработка = Ложь;
		ТекстСообщения = НСтр("ru = 'Документ ""%1"" с типом статуса ""%2"", не может использоваться в документе.'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ВыбранноеЗначение, ТипСтатусаДокументаПланирования);
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыПланированияПричинаЗакрытияПриИзменении(Элемент)
	
    ПричинаЗакрытия = Элементы.ДокументыПланирования.ТекущиеДанные.ПричинаЗакрытия;
	
	Регламент = ПредопределенноеЗначение("Справочник.бит_ПричиныЗакрытияДокументовПланированияПлатежа.Регламент");
	Если ПричинаЗакрытия = Регламент Тогда
		Элементы.ДокументыПланирования.ТекущиеДанные.ПричинаЗакрытия = ПредопределенноеЗначение("Справочник.бит_ПричиныЗакрытияДокументовПланированияПлатежа.ПустаяСсылка");
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Причина закрытия """ + Регламент + """ устанавливается только регламентной операцией.", 
			Объект, "Объект.ДокументыПланирования[" + (Элементы.ДокументыПланирования.ТекущиеДанные.НомерСтроки - 1) + "].ПричинаЗакрытия");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыПланированияДокументПланированияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДокументыПланирования.ТекущиеДанные;
	
	бит_РаботаСДиалогамиКлиент.НачалоВыбораСоставного(ЭтотОбъект
	                                                   ,Элемент
	                                                   ,ТекущиеДанные
	                                                   ,"ДокументПланирования"
													   ,мКэшЗначений.СписокТиповДокументПланирования
													   ,СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыПланированияДокументПланированияОчистка(Элемент, СтандартнаяОбработка)
	
	Элемент.ВыбиратьТип = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область СтандартныеПодсистемыОбработчикиКоманд

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(Знач ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти  

&НаКлиенте
Процедура Подбор(Команда)
	
	ПараметрыФормы	   = Новый Структура;
	ПараметрыФормы.Вставить("РежимПодбора", Истина);
	ПараметрыФормы.Вставить("Организация", Объект.Организация);
	
	РежимОтрытия	   = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	ОписаниеОповещения = Новый ОписаниеОповещения("ПодборЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("Обработка.бит_ЗакрытиеДокументовПланирования.Форма", ПараметрыФормы, ЭтотОбъект, 
		ЭтотОбъект,,, ОписаниеОповещения, РежимОтрытия);
		
КонецПроцедуры
	
// Обработчик завершения открытия формы.
//  См. Синтакс-помощник: ОткрытьФорму().
//
&НаКлиенте
Процедура ПодборЗавершение(Результат, Дополнительно) Экспорт

	Если Результат <> Неопределено И ЭтоАдресВременногоХранилища(Результат) Тогда
		ОбработатьРезультатПодбораНаСерере(Результат)	
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура заполняет кэш значений, необходимый при работе на клиенте.
//
&НаСервере
Процедура ЗаполнитьКэшЗначений(КэшированныеЗначения)

	КэшированныеЗначения = Новый Структура;
		
	// заполним список типов для быстрого выбора составного
	МассивТипов  = Объект.Ссылка.Метаданные().ТабличныеЧасти.ДокументыПланирования.Реквизиты.ДокументПланирования.Тип.Типы();
	СписокВыбора = бит_ОбщегоНазначения.ПодготовитьСписокВыбораТипа(МассивТипов);
	
	КэшированныеЗначения.Вставить("СписокТиповДокументПланирования",СписокВыбора);
	
КонецПроцедуры

//  Процедура проверяет возможность создания документа закрытия. 
//
// Параметры:
//  Основание - ДокументСсылка.
//  Отказ - Булево.
//
&НаСервере
Процедура ПроверитьВозможностьСозданияЗакрытия(Основание, Отказ)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	РегистрСтатусыОбъектов.Объект КАК Документ
	|ИЗ
	|	РегистрСведений.бит_СтатусыОбъектов КАК РегистрСтатусыОбъектов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бит_СтатусыОбъектов КАК СправочникСтатусыОбъектов
	|		ПО РегистрСтатусыОбъектов.Статус = СправочникСтатусыОбъектов.Ссылка
	|			И (РегистрСтатусыОбъектов.ВидСтатуса = ЗНАЧЕНИЕ(Перечисление.бит_ВидыСтатусовОбъектов.Статус))
	|			И (РегистрСтатусыОбъектов.Объект = &Документ)
	|			И (СправочникСтатусыОбъектов.ТипСтатуса = ЗНАЧЕНИЕ(Перечисление.бит_ТипыСтатусовОбъектов.Закрыт))";	
	Запрос.УстановитьПараметр("Документ", Основание);	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		ТекстСообщения = НСтр("ru='Создание Закрытия документов планирования, невозможно в статусе Закрыт.';
								  |en='Creating a private planning documents, it is impossible in the status of closing.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ТипСтатуаВыбранногоЗначения(ВыбранноеЗначение)
	
	Статус = бит_ВизированиеСервер.ТекущийСтатус(ВыбранноеЗначение);
	Возврат Справочники.бит_СтатусыОбъектов.ТипСтатусаОбъкта(Статус);
	
КонецФункции

&НаСервере
Процедура ОбработатьРезультатПодбораНаСерере(АдресРезультата)

	Перем ПереченьДокументов;
	Перем ПричинаЗакрытия;
	
	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		Результат.Свойство("ПереченьДокументов", ПереченьДокументов);
		Результат.Свойство("ПричинаЗакрытия", 	 ПричинаЗакрытия);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ПереченьДокументов) Тогда
		Возврат;	
	КонецЕсли;
	
    Запрос = Новый Запрос;
    Запрос.УстановитьПараметр("ПереченьДокументов", ПереченьДокументов);
	Запрос.УстановитьПараметр("ПричинаЗакрытия", 	ПричинаЗакрытия);
	Запрос.УстановитьПараметр("Организация", 		Объект.Организация);
	
	Запрос.Текст	 = ТекстЗапросаПереченьДокументов();
    РезультатЗапроса = Запрос.Выполнить();
    
    Если РезультатЗапроса.Пустой() Тогда
        Возврат;
	КонецЕсли;
	
	Объект.ДокументыПланирования.Очистить();
	ВыборкаПоДокументам   = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПоДокументам.Следующий() Цикл
		НоваяСтрока = Объект.ДокументыПланирования.Добавить(); 
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаПоДокументам);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ТекстЗапросаПереченьДокументов()

	ТекстЗапроса = 
    "ВЫБРАТЬ
    |	ПереченьДокументов.Организация КАК Организация,
    |	ПереченьДокументов.ДокументПланирования КАК ДокументПланирования,
    |	ПереченьДокументов.Позиция КАК Позиция,
    |	ВЫБОР
    |		КОГДА ПереченьДокументов.ПричинаЗакрытия = ЗНАЧЕНИЕ(Справочник.бит_ПричиныЗакрытияДокументовПланированияПлатежа.ПустаяСсылка)
    |			ТОГДА &ПричинаЗакрытия
    |		ИНАЧЕ ПереченьДокументов.ПричинаЗакрытия
    |	КОНЕЦ КАК ПричинаЗакрытия,
    |	ПереченьДокументов.Закрыть КАК Закрыть
    |ПОМЕСТИТЬ ВТ_ОбщийСписок
    |ИЗ
    |	&ПереченьДокументов КАК ПереченьДокументов
    |ГДЕ
    |	ПереченьДокументов.Закрыть
    |	И ПереченьДокументов.Организация = &Организация
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ РАЗЛИЧНЫЕ
    |	ВТ_ОбщийСписок.Организация КАК Организация,
    |	ВТ_ОбщийСписок.ДокументПланирования КАК ДокументПланирования,
    |	МАКСИМУМ(ВТ_ОбщийСписок.ПричинаЗакрытия) КАК ПричинаЗакрытия,
    |	ВТ_ОбщийСписок.Закрыть КАК Закрыть
    |ИЗ
    |	ВТ_ОбщийСписок КАК ВТ_ОбщийСписок
    |
    |СГРУППИРОВАТЬ ПО
    |	ВТ_ОбщийСписок.Организация,
    |	ВТ_ОбщийСписок.ДокументПланирования,
    |	ВТ_ОбщийСписок.Закрыть
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	ВТ_ОбщийСписок.Организация,
    |	ВТ_ОбщийСписок.Позиция,
    |	ВТ_ОбщийСписок.ПричинаЗакрытия,
    |	ВТ_ОбщийСписок.Закрыть
    |ИЗ
    |	ВТ_ОбщийСписок КАК ВТ_ОбщийСписок
    |ГДЕ
    |	ВТ_ОбщийСписок.Позиция <> НЕОПРЕДЕЛЕНО";

	Возврат ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();

КонецФункции

#КонецОбласти
